---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationServiceMismatch
source: html/9aad06fb-1f3a-a55b-4ec5-0c1903a0c9e6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationServiceMismatch Property

Attempting to connect fabrication parts from different services.

## Syntax (C#)
```csharp
public static FailureDefinitionId FabricationServiceMismatch { get; }
```